// © Copyright 2012, 2015 HP Development Company, L.P.

TaskName = "Enable Direct Print on Your Device";

TaskTOCTitle = "HP Direct Print";

HeaderMessage = "Make it easy to print from wireless-enabled smartphones, notebook computers or other mobile devices, using direct wireless connection. The mobile device needs to be in the wireless range of the printer and requires an HP ePrint driver or mobile app. For more information and to download apps visit the HP online website";
EnableDirectPrint = "Enable Direct Print";

SecurityOnPasswordTitle = "On (With Security)";
SecurityOnTitle = "On (No Security)";
SecurityOffTitle = "Off";

SecurityOnAlertTitle = "(Warning: When Direct Printing is enabled unauthorized users within wireless range can potentially connect and print to your printer.)";
PasswordTitle = "Passphrase:";
PassphraseTooShortErrorMessage = "Passphrase must be at least 8 characters long.";